app/Controllers/Producto.php

    public function login(): string
    {
        $productoM = model('ProductosM');
        $data['productos'] = $productoM->findAll();
---
SELECT *
FROM `productos`

    public function listaProductos(): string
    {
        $productoM = model('ProductosM');
        $data['productos'] = $productoM->findAll();
---
SELECT *
FROM `productos`

    public function verDetalle($idProducto)
    {
        $productoM = model('ProductosM');
        $data['producto'] = $productoM->where('idProducto', $idProducto)->findAll();
---
SELECT *
FROM `productos`
WHERE `idProducto` = '6'

    public function pagar()
    {
        $session = session();
        // Verifica que haya un cliente logueado en la sesión
        if (!$session->has('idCliente')) {
            echo "Error: Cliente no autenticado.";
            return;
        }
        $total =   $_POST['total'];

        $ventasM = model('ventasModel');
        $carritoM = model('CarritoModel');
        $idCliente = $session->get('idCliente');

        $dataVenta = [
            'idCliente' => $idCliente,
            'fecha' => date('Y-m-d'),
            'total' => $total
        ];
        $ventasM->insert($dataVenta);
        $idVenta = $ventasM->getInsertID();

        foreach ($session->get('carrito') as $item) {
            $dataVentaProducto = [
                'IdVenta' => $idVenta,
                'IdProducto' => $item['idProducto'],
                'cantidad' => $item['cantidad'],
                'precio' => $item['costo'],
                'subtotal' => $item['subtotal']
            ];
            $carritoM->insert($dataVentaProducto);
---
INSERT INTO `ventas` (`idCliente`, `fecha`, `total`) VALUES ('1', '2024-11-03', '350')
INSERT INTO `venta_productos` (`IdVenta`, `IdProducto`, `cantidad`, `precio`, `subtotal`) VALUES (38, '4', '1', '350.00', 350)